package com.example.test.activities;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import com.example.test.R;
import com.example.test.adapters.AllDoaaAdapter;
import com.example.test.adapters.CitationNightAdapter;
import com.example.test.models.AllDoaa;

import java.util.ArrayList;

public class AllDoaaActivity extends AppCompatActivity {
    private RecyclerView mRecyclerViewDoaa;
    private RecyclerView.Adapter mAdapterDoaa;
    private RecyclerView.LayoutManager mLayoutManagerDoaa;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_all_doaa);
        ArrayList<AllDoaa> allDoaas = new ArrayList<>();
        allDoaas.add(new AllDoaa("عند النوم نقول:\n" +
                "\"بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا\" [رواه البخاري]\n"));
        allDoaas.add(new AllDoaa("عند الأستيقاظ من النوم نقول:\n" +
                "\" الحَمْدُ لله الذِي أحْيَانا بَعْدَ مَا أمَاتَنَا ،وإلَيْهِ النَشُور\" [رواه البخاري، ومسلم]\n"));
        allDoaas.add(new AllDoaa("عند دخول الخلاء نقول:\n" +
                "\"(بِسْمِ الله) اللّهُـمَّ إِنِّـي أَعـوذُ بِـكَ مِـنَ الْخُـبْثِ ،وَالْخَبائِث.\" [رواه البخاري]\n"));
        allDoaas.add(new AllDoaa("بعد الخروج من الخلاء نقول:\n" +
                "\"غُفْـرانَك.\"  [الترمذي]\n"));
        allDoaas.add(new AllDoaa("عند لبس الثياب نقول\n" +
                "\"ومَنْ لَبِسَ ثوباً فقال : الحمدُ لله الذي كَساني هذا الثـوب ورَزَقنيه مِنْ غيِر حـولٍ منِّي ولا قُوّةٍ\"  [رواه أبو داود، والترمذي]\n"));
        allDoaas.add(new AllDoaa("عند لبس الثياب الجديد نقول:\n" +
                "\" اللَّهمَّ لكَ الحمدُ, أنتَ كَسَوتنِيهِ أسألُكَ مِنْ خيرهِ, وخيرِ ما صُنِعَ لهُ, وأعوذُ بكَ من شرِّهِ, وشرِّ ما صُنِعَ لهُ \" [رواه أبو داود، والترمذي]\n"));
        allDoaas.add(new AllDoaa("عندما نرى مسلمًا يلبس ثوبًا جديدًا، نقول له :\n" +
                "\"الْبِسْ جَدِيدًا، وَعِشْ حَمِيدًا، وَمِتْ شَهِيدًا\" [رواه ابن ماجة]\n"));
        allDoaas.add(new AllDoaa("قبل الطعام نقول:\n" +
                "\"بِسم الله\" فإن نسينا نقول\"بِسمِ الله أوله، وآخره، اللهم بارك لنا فيه وأطعمنا خيراً منه\" [رواه أبو داود، والترمذي]\n"));
        allDoaas.add(new AllDoaa("بعد الطعام نقول :\n" +
                "\" الحمد لله الذي أطعمني هذا ،وزرقنيه ،من غير حول مني ولا قوة\" [رواه أبو داود، والترمذي]\n"));
        allDoaas.add(new AllDoaa("دعاء الضيف لصاحب الطعام:\n" +
                "\"اللهمَّ أطعِم من أطعمني, وأسقِ من سقاني\"\n" +
                "\"اللهُمَّ بَارِكْ لَهُم فيما رَزَقتهْمْ، واغْفِر لهم وارحَمْهُم\" [رواه مسلم]\n"));
        allDoaas.add(new AllDoaa("عند الخروج من المنزل نقول :\n" +
                "\"بسمِ اللهِ, توكلتُ على اللهِ, اللهمَّ إني أعوذ بك من أن أضِلَّ أو أُضلُّ, أو أَزِلَّ أو أُزَلُّ, أو أَظْلمَّ أو أُظْلمُّ, أو أَجْهـلَّ أو يُجْهلُّ عليّ, أو أن أبغي أو يُبغى عليَّ \"  [رواه أبو داود، والترمذي]\n"));
        allDoaas.add(new AllDoaa("عند دخول المنزل نقول :\n" +
                "\"اللهم إني أسألك خير المولج وخير المخرج، بسم الله ولجنا، وبسم الله خرجنا، بسم الله ولجنا، وبسم الله خرجنا، وعلى ربنا توكلنا\" [رواه أبو داود]\n"));
        allDoaas.add(new AllDoaa("عند دخول المسجد نقول:\n" +
                "\"بِسْمِ اللَّهِ\"،\"والصَّلَاةُ، وَالسَّلَامُ عَلَى رَسُولِ اللهِ\"، \"اللهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ\" [رواه أبو داود، ومسلم]\n"));
        allDoaas.add(new AllDoaa("عند الخروج من المسجد نقول:\n" +
                "\"بِسْمِ اللَّهِ\"،\"والصَّلَاةُ، وَالسَّلَامُ عَلَى رَسُولِ اللهِ\"،\"اللهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ\"  [رواه أبو داود، ومسلم]\n"));
        allDoaas.add(new AllDoaa("الدعاء للمريض :\n" +
                "\"لَا بَأْسَ طَهُورٌ إِِنْ شَاءَ اللهُ\"، \"أَسْأَلُ اللهَ الْعَظِيمَ، رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشْفِيَكَ\" [سبع مرات] [رواه البخاري]\n"));
        allDoaas.add(new AllDoaa("دعاء نزول المطر:\n" +
                "\" اللهم صيباً نافعاً \" [رواه البخاري]\n"));
        allDoaas.add(new AllDoaa("دعاء الوسوسة في الصلاة والقراءة:\n" +
                "\" أعوذ بالله من الشيطان الرجيم واتفل على يسارك ( ثلاثاً )\" [رواه مسلم]\n"));
        allDoaas.add(new AllDoaa("دعاء القلق والفزع في النوم :\n" +
                "\"أعوذ بكلمات الله التَّامَّة من غضبه وعقابه، وشر عباده، ومن همزات الشياطين وأنْ يحضرون\" [الترمذي]\n"));
        allDoaas.add(new AllDoaa("دعاء صلاة الأستخارة :\n" +
                "\" اللهم إني أستخيرك بعلمك ، وأستقدرك بقدرتك ، وأسألك من فضلك العظيم فإنك تقدِرُ ولا أقدِرُ ، وتعلم ولا أعلم ، وأنت علام الغيوب ، اللهم إن كنت تعلم أن هذا الأمر -يسمي حاجته - خير لي في ديني ومعاشي وعاقبة أمري - أو قال : عاجلة وآجله - فاقدره لي ويسره لي ، ثم بارك لي فيه ، وإن كنت تعلم أن هذا الأمر شر في ديني ومعاشي وعاقبة أمري - أو قال : عاجله وآجله - فاصرفه عني واصرفني عنه ، واقدر لي الخير حيث كان ، ثم ارضني به \"\n"));
        allDoaas.add(new AllDoaa("دعاء العطاس:\n" +
                "\" إذا عطس أحدكم فليقل الحمد لله ،وليقل له أخوهُ أو صاحبهُ : يرحمك الله ،فإذا قال لهُ :يرحمك الله ،فليقل :يهديكم الله ويصلح بالكم \" [رواه البخاري]\n"));
        allDoaas.add(new AllDoaa("عند سماع نهيق الحمار نقول:\n" +
                "\"أَعُوذُ بِالْلَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ\" [رواه البخاري، ومسلم]\n"));
        allDoaas.add(new AllDoaa("دعاء زيارة القبور:\n" +
                "\"السلام عليكم أهل الديار ، من المؤمنين والمسلمين، وإنا إن شاء بكم لاحقون [ ويرحم الله المُستقدمين منا والمستأخرين ] أسأل الله لنا ولكم العافية\" [رواه مسلم]\n"));
        allDoaas.add(new AllDoaa("دعاء السفر:\n" +
                "\"الله أكبر، الله أكبر، الله أكبر\"، \"اللهم إنا نسألُكَ في سفرنا هذا البرَّ والتقوى، ومن العمل ما ترضى، اللهم هون علينا سفرنا هذا واطو عنا بعده، اللهم أنت الصاحب في السفر، والخليفة في الأهل، اللهم إني أعوذ بك من وعْثاءِ السفر، وكآبة المنظر وسوء المنقلب في المال والأهل\" وإذا رجع قالهن وزاد فيهن \"آيبون، تائبون، عابدون، لربنا حامدون\" [رواه مسلم]\n"));
        allDoaas.add(new AllDoaa("دعاء الركوب:\n" +
                "\" بسم الله، الحمد لله ،الحمد لله، الحمد لله، الحمد لله، الله اكبر، الله اكبر، الله اكبر، سبحانك اللهم إني ظلمت نفسي فاغفر لي،إنه لا يغفر الذنوب إلا أنت\" [أبو داود]\n"));
        allDoaas.add(new AllDoaa("عند الاستفتاح في قيام الليل :\n" +
                "\n" +
                "\"اللهم ربَّ جبرائيل وميكائيل وإسرافيل، فاطر السموات والأرض،عالم الغيب والشهادة، أنت تحكم بين عبادك فيما كانوا فيه يختلفون، أهدني لما اختلف فيه من الحق بإذنك إنك تهدي من تشاء إلى صراط مستقيم\" [مسلم]\n" +
                "\n" +
                "\n" +
                "\"اللهم أغفر لي، وأهدني، وارزقني، وعافني، وأعوذ بالله من ضيق المقام يوم القيامة\"[أبو داود]\n" +
                "\n" +
                "\n" +
                "\"اللهم لك الحمد، أنت نور السموات والأرض ومن فيهن، ولك الحمد أنت قيَّم السموات والأرض ومن فيهن ، ولك الحمد أنت رب السموات والأرض ومن فيهن، ولك الحمد لك ملك السموات والأرض ومن فيهن ولك الحمد) (أنت الحق ووعدك الحق، وقولك الحق، ولقاؤك الحق، والجنة حق، والنار حق، والنبيون حق، ومحمد صلى الله عليه وسلم حق، والساعة حق\""));
        allDoaas.add(new AllDoaa("عند الاستفتاح في الصلاة :\n" +
                "\n" +
                "\"اللهم باعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب، اللهم نقني من خطاياي كما يُنقَّى الثوب الأبيض من الدنس، اللهم أغسلني من خطاياي بالثلج والماء والبرد \"[متفق عليه]\n" +
                "\" سبحانك اللهم وبحمدك وتبارك اسمك، وتعالى جدك، ولا إله غيرك (مسلم) الحمد لله حمداً كثيراً طيباً مباركاً فيه \"[مسلم]\n" +
                "\" الله أكبر كبيراً، والحمد لله كثيراً، وسبحان الله بكرة وأصيلاً \"[مسلم]"));
        allDoaas.add(new AllDoaa("عند الوباء نقول:\n" +
                "\"بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ\" [ثلاث مرات] [رواه أبو داود، والترمذي]\n" +
                "\n" +
                "\" أعوذ بكلمات الله التامات من شر ما خلق \"[ثلاث مرات صباحًا ومساءًا] \n" +
                "\n" +
                "\" اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي \"[رواه أبو داود]\n" +
                " \n" +
                "\"اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ ، وَتَحَوُّلِ عَافِيَتِكَ ، وَفُجَاءَةِ نِقْمَتِكَ ، وَجَمِيعِ سَخَطِكَ \"[رواه مسلم]\n" +
                "\n" +
                "\" اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْبَرَصِ وَالْجُنُونِ وَالْجُذَامِ وَمِنْ سَيِّئْ الْأَسْقَامِ \"[رواه أحمد، وأبوداود ]\n" +
                "\" بِسْمِ اللهِ الرّحمَنِ الرَّحِيْمِ اللهُمَّ اِني أسئلك بعدد خلقك , بعزة عرشك , برضى نفسك , بنور وجهك , بمبلغ علمك وحلمك , ببقاء قدرك ببسط قدرتك , بمنتهى رحمتك , بأدراك مشيئتك , بكلية ذاتك ، بكل صفاتك , بتمام وصفك , بنهاية أسمائك , بمكنون سرك , بجميل برك , بجزيل عطائك , بكمال منك, بفيض جودك, بشديد غضبك بسباق رحمتك , بعدد كلماتك , بغاية بلوغك , بتفرد فردانيتك , بتوحيد وحدانيتك , ببقاء بقائك , بسرمدية أوقاتك ، بعزة ربويتك , بعظمة كبريائك , بجاه جلالك , بكمالك ، بجمالك ، بأفعالك , بإنعامك , بسيادتك , بملوكيتك ، بجباريتك ، بمشيئتك , بعظمتك , بلطفك , بسرِّك , ببرك , بإحسانك , بحقك , وبحق حقك , وبحق رسولك محمد المصطفى صلى الله عليه وآله ( !! ) : أن تجعل لنا فرجاً ومخرجاً , وشفاء من الغموم والبلاء والوباء والطعن والطاعون والعناء ، ومن جميع الأمراض والآفات والعاهات والبليات ، في الدنيا والآخرة , وبحق \" كهيعص \" ، وبحق \" طه \" و \" يس \" و \" ص \" ، وبحق \" حمعسق \" ، وبحق ( إنا فتحنا فتحنا لك فتحا مبينا ليغفر لك الله ما تقدم من ذنبك وما تأخر ) , وبرحمتك يا أرحم الراحمين , وصلى الله على محمد وآله الطيبين الطاهرين \"."));
        allDoaas.add(new AllDoaa("عند سماع الأذان:\n" +
                "\n" +
                "”يَقُولُ مِثْلَ مَا يَقُولُ الـمُؤَذِّنُ إلاَّ فِي “حَيَّ عَلَى الصَّلاةِ وَحَيَّ عَلَى الفَلاَحِ” فَيَقُولُ: “لاَ حَوْلَ وَلا قُوَّةَ إلاَّ باللَّهِ”. \n" +
                "\n" +
                "\n" +
                "“مَنْ قَال حِينَ يسْمعُ المُؤذِّنَ : أَشْهَد أَنْ لا إِله إِلاَّ اللَّه وحْدهُ لا شَريك لهُ ، وَأَنَّ مُحمَّداً عبْدُهُ وَرسُولُهُ ، رضِيتُ بِاللَّهِ ربًّا ، وبمُحَمَّدٍ رَسُولاً ، وبالإِسْلامِ دِينًا ، غُفِر لَهُ ذَنْبُهُ”. [رواه مسلم ]\n" +
                "\n" +
                "\n" +
                "اللَّهُمَّ رَبَّ هذِهِ الدَّعوةِ التَّامَّةِ ، والصَّلاةِ الْقَائِمةِ، آت مُحَمَّداً الْوسِيلَةَ ، والْفَضَيِلَة، وابْعثْهُ مقَامًا محْمُوداً الَّذي وعَدْتَه ، حلَّتْ لَهُ شَفَاعتي يوْم الْقِيامِة” .[رواه البخاري]"));
        allDoaas.add(new AllDoaa("بعد السلام من الصلاة:\n" +
                "\n" +
                " \" أستغفر الله \" [ثلاث مرات]\n" +
                "\n" +
                "\" اللهم أنت السلام ، ومنك السلام ، تباركت يا ذا الجلال والإكرام\"[مسلم]\n" +
                "\n" +
                " \" لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ وَلَا مُعْطِيَ لِمَا مَنَعْتَ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ \"[البخاري ومسلم]\n" +
                "\n" +
                " \"لا إله إلا الله وحده لا شريك له،له الملك وله الحمد وهو على كل شئ قدير،لا حول ولا قوة إلا بالله،لا إله إلا الله،ولا نعبد إلا إياه ، له النعمة وله الفضل ،وله الثناء الحسن،لا إله إلا الله مخلصين له الدين ولو كره الكافرون\"[مسلم] .\n" +
                "\n" +
                " \" سبحان الله ، والحمد لله ، والله أكبر [ ثلاثاً وثلاثين ]\n" +
                " \n" +
                "لا إله إلا الله وحده لا شريك له ، له الملك وله الحمد وهو على كل شيء قدير \""));

        mRecyclerViewDoaa = findViewById(R.id.recyclerView_all_doaa);
        mRecyclerViewDoaa.setHasFixedSize(true);
        mLayoutManagerDoaa = new LinearLayoutManager(this);
        mAdapterDoaa = new AllDoaaAdapter(allDoaas);
        mRecyclerViewDoaa.setLayoutManager(mLayoutManagerDoaa);
        mRecyclerViewDoaa.setAdapter(mAdapterDoaa);
    }
}