package com.example.test.activities;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import com.example.test.R;
import com.example.test.adapters.AsmaaAllahAdapter;
import com.example.test.adapters.HadeethAdapter;
import com.example.test.models.Hadeeth;

import java.util.ArrayList;

public class HadeethActivity extends AppCompatActivity {
    private RecyclerView mRecyclerViewHadeeth;
    private RecyclerView.Adapter mAdapterHadeeth;
    private RecyclerView.LayoutManager mLayoutManagerHadeeth;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_hadeeth);
        ArrayList<Hadeeth> arrayListHadeeth = new ArrayList<>();
        arrayListHadeeth.add(new Hadeeth("أحب الأعمال إلى الله :\n" +
                "عن عبدالله بن مسعود رضي الله عنه قال: سألت النبي صلى الله عليه وسلم: أي العمل أحب إلى الله؟ قال: (الصلاة على وقتها)، قال: ثم أي؟ قال: (ثم بر الوالدين) قال: ثم أي؟ قال: (الجهاد في سبيل الله) رواه البخاري ومسلم"));
        arrayListHadeeth.add(new Hadeeth("كلمتان حبيبتان إلى الرحمن :\n" +
                "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (كلمتان خفيفتان على اللسان، ثقيلتان في الميزان، حبيبتان إلى الرحمن، سبحان الله وبحمده، سبحان الله العظيم) رواه البخاري ومسلم"));
        arrayListHadeeth.add(new Hadeeth("فضل صلاة سنّة الفجر :\n" +
                "عن عائشة رضي الله عنها عن النبي صلى الله عليه وسلم قال: (ركعتا الفجر خير من الدنيا وما فيها) رواه مسلم"));
        arrayListHadeeth.add(new Hadeeth("إنما الأعمال بالنيات:\n" +
                "عن عمر بن الخطاب رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: (إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه) رواه البخاري ومسلم."));
        arrayListHadeeth.add(new Hadeeth("فضل الصلاة على رسول الله :\n" +
                "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (من صلى علي صلاة واحدة صلى الله عليه عشراً) رواه مسلم"));
        arrayListHadeeth.add(new Hadeeth("اللغو في صلاة الجمعة :\n" +
                "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (إذا قلت لصاحبك: أنصت، يوم الجمعة والإمام يخطب، فقد لغوت) رواه البخاري ومسلم"));
        arrayListHadeeth.add(new Hadeeth("التحذير من الكذب على رسول الله :\n" +
                "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (من كذب علي متعمداً فليتبوأ مقعده من النار) رواه البخاري ومسلم."));
        arrayListHadeeth.add(new Hadeeth("كل امتي يدخلون الجنة إلا من:\n" +
                "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (كل أمتي يدخلون الجنة إلا من أبى) قالوا: يا رسول الله: ومن يأبى؟ قال: (من أطاعني دخل الجنة، ومن عصاني فقد أبى) رواه البخاري"));
        arrayListHadeeth.add(new Hadeeth("المؤمن القوي والمؤمن الضعيف: \n" +
                "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف، وفي كل خير، احرص على ما ينفعك، واستعن بالله ولا تعجز، وإن أصابك شيء فلا تقل: لو أني فعلت كان كذا وكذا، ولكن قل: قدَر الله وما شاء فعل، فإن لو تفتح عمل الشيطان) رواه مسلم"));
        arrayListHadeeth.add(new Hadeeth("فضل إحصاء أسماء الله الحسنى :\n" +
                "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (إن لله تسعة وتسعين اسما مائة إلا واحدا، من أحصاها دخل الجنة) رواه البخاري ومسلم"));
        arrayListHadeeth.add(new Hadeeth("العزم في الدعاء :\n" +
                "قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم (( إِذَا دَعَا أَحَدُكُمْ فَلْيَعْزِمْ فِي الدُّعَاءِ وَلاَ يَقُلِ اللَّهُمَّ إِنْ شِئْتَ فَأَعْطِنِي فَإِنَّ اللَّهَ لاَ مُسْتَكْرِهَ لَهُ )) رواه البخاري"));
        arrayListHadeeth.add(new Hadeeth("من أحب لقاء الله أحب الله لقاءه :\n" +
                "عَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ (( مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ))"));
        arrayListHadeeth.add(new Hadeeth("أنا عند حسن ظن عبدي بي :\n" +
                "عَنْ يَزِيدَ بْنِ الأَصَمِّ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم (( إِنَّ اللَّهَ يَقُولُ أَنَا عِنْدَ ظَنِّ عَبْدِي بِي وَأَنَا مَعَهُ إِذَا دَعَانِي )) صحيح مسلم"));
        arrayListHadeeth.add(new Hadeeth("سُقُوطِ الذُّنُوبِ بِالاِسْتِغْفَارِ تَوْبَةً :\n" +
                "عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم (( وَالَّذِي نَفْسِي بِيَدِهِ لَوْ لَمْ تُذْنِبُوا لَذَهَبَ اللَّهُ بِكُمْ وَلَجَاءَ بِقَوْمٍ يُذْنِبُونَ فَيَسْتَغْفِرُونَ اللَّهَ فَيَغْفِر لَهُمْ )) صحيح مسلم"));
        arrayListHadeeth.add(new Hadeeth("المرء يبعث على ما مات عليه :\n" +
                "عن جابر رضي الله عنه، قَالَ: قَالَ رسول الله صلى الله عليه وسلم: (( يُبْعَثُ كُلُّ عَبْدٍ عَلَى مَا مَاتَ عَلَيهِ )) رواه مسلم"));
        arrayListHadeeth.add(new Hadeeth("من نفس عن مؤمن نفس الله عنه :\n" +
                "قال رسول الله صلى الله عليه وسلم: (مَن نَفَّسَ عن مُؤْمِنٍ كُرْبَةً مِن كُرَبِ الدُّنْيَا، نَفَّسَ اللَّهُ عنْه كُرْبَةً مِن كُرَبِ يَومِ القِيَامَةِ، وَمَن يَسَّرَ علَى مُعْسِرٍ، يَسَّرَ اللَّهُ عليه في الدُّنْيَا وَالآخِرَةِ، وَمَن سَتَرَ مُسْلِمًا، سَتَرَهُ اللَّهُ في الدُّنْيَا وَالآخِرَةِ، وَاللَّهُ في عَوْنِ العَبْدِ ما كانَ العَبْدُ في عَوْنِ أَخِيهِ، وَمَن سَلَكَ طَرِيقًا يَلْتَمِسُ فيه عِلْمًا، سَهَّلَ اللَّهُ له به طَرِيقًا إلى الجَنَّةِ، وَما اجْتَمع قَوْمٌ في بَيْتٍ مِن بُيُوتِ اللهِ، يَتْلُونَ كِتَابَ اللهِ، وَيَتَدَارَسُونَهُ بيْنَهُمْ، إِلَّا نَزَلَتْ عليهمِ السَّكِينَةُ، وَغَشِيَتْهُمُ الرَّحْمَةُ وَحَفَّتْهُمُ المَلَائِكَةُ، وَذَكَرَهُمُ اللَّهُ فِيمَن عِنْدَهُ، وَمَن بَطَّأَ به عَمَلُهُ، لَمْ يُسْرِعْ به نَسَبُهُ. غيرَ أنَّ حَدِيثَ أَبِي أُسَامَةَ ليسَ فيه ذِكْرُ التَّيْسِيرِ علَى المُعْسِرِ) رواه مسلم"));
        arrayListHadeeth.add(new Hadeeth("أداء السنن الرواتب :\n" +
                "عن أم حبيبة رضي الله عنها أنها سمعـت رسول الله صلى الله عليه وسلم يقول( ما من عبد مسلم يصلي لله كل يوم ثنتي عشرة ركعة تطوعًا غير الفريضة ، إلا بنى الله له بيتًا في الجنة ) رواه مسلم\n" +
                "* السنن الرواتب: عددها اثنتا عشرة ركعة، في اليوم والليلة : أربع ركعات قبل الظهر ، وركعتان بعدها ، وركعتان بعد المغرب ، وركعتان بعد العشاء ، وركعتان قبل الفجر."));
        arrayListHadeeth.add(new Hadeeth("استوصوا بالنساء :\n" +
                "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (استوصوا بالنساء، فإن المرأة خلقت من ضلع، وإن أعوج شيء في الضلع أعلاه، فإن ذهبت تقيمه كسرته، وإن تركته لم يزل أعوج، فاستوصوا بالنساء) رواه البخاري ومسلم"));
        arrayListHadeeth.add(new Hadeeth("أقرب ما يكون العبد من ربه وهو .. :\n" +
                "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (أقرب ما يكون العبد من ربه وهو ساجد فأكثروا الدعاء) رواه مسلم"));
        arrayListHadeeth.add(new Hadeeth("من صلى العشاء في جماعة .. :\n" +
                "عن عثمان بن عفان رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (من صلى العشاء في جماعة فكأنما قام نصف الليل، ومن صلى الصبح في جماعة فكأنما قام الليل كله) رواه مسلم"));




        mRecyclerViewHadeeth = findViewById(R.id.recyclerView_hadeeth);
        mRecyclerViewHadeeth.setHasFixedSize(true);
        mLayoutManagerHadeeth = new LinearLayoutManager(this);
        mAdapterHadeeth = new HadeethAdapter(arrayListHadeeth);
        mRecyclerViewHadeeth.setLayoutManager(mLayoutManagerHadeeth);
        mRecyclerViewHadeeth.setAdapter(mAdapterHadeeth);

    }
}