package com.example.test.activities;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import com.example.test.R;
import com.example.test.adapters.AsmaaAllahAdapter;
import com.example.test.adapters.SonnaNabawyaAdapter;
import com.example.test.models.SonnaNabawya;

import java.util.ArrayList;

public class SonnaNabawyaActivity extends AppCompatActivity {
    private RecyclerView mRecyclerViewSonnaNabawya;
    private RecyclerView.Adapter mAdapterSonnaNabawya;
    private RecyclerView.LayoutManager mLayoutManagerSonnaNabawya;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_sonna_nabawya);
        ArrayList<SonnaNabawya> sonnaNabawyaArrayList = new ArrayList<>();
        sonnaNabawyaArrayList.add(new SonnaNabawya("الأدعية اللي وردت عن الرسول صلى الله عليه وسلم:\n«اللَّهُمَّ رَبَّنَا لَكَ الحَمْدُ، أَنْتَ قَيِّمُ السَّمَاوَاتِ وَالأَرْضِ، وَلَكَ الحَمْدُ أَنْتَ رَبُّ السَّمَاوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الحَمْدُ، أَنْتَ نُورُ السَّمَاوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، أَنْتَ الحَقُّ، وَقَولُكَ الحَقُّ، وَوَعْدُكَ الحَقُّ، وَلِقَاؤُكَ الحَقُّ، وَالجَنَّةُ حَقٌّ، وَالنَّارُ حَقٌّ، وَالسَّاعَةُ حَقٌّ اللَّهُمَّ لَكَ أَسْلَمْتُ، وَبِكَ آمَنْتُ، وَعَلَيكَ تَوَكَّلْتُ، وَإليكَ خَاصَمْتُ، وَبِكَ حَاكَمْتُ، فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَأَسْرَرْتُ وَأَعْلَنْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي لا إلَهَ إلَّا أَنْتَ». متفق عليه."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ، وَعَافِنِي فِيمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ، إِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ، وإِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ، وَلاَ يَعِزُّ مَنْ عَادَيْتَ، تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ». أخرجه أبو داود والترمذي."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ صَلِّ عَلَى محَمَّدٍ وَعَلَى آلِ محَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى محَمَّدٍ وَعَلَى آلِ محَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ». متفق عليه."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ». متفق عليه."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ، وَالجُبْنِ وَالهَرَمِ وَالبُخْلِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، وَمِنْ فِتْنَةِ المَحْيَا وَالمَمَاتِ». متفق عليه."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«يتعوذ بِالله مِنْ جَهْدِ البَلاءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ القَضَاءِ، وَشَمَاتَةِ الأَعْدَاءِ». متفق عليه."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ أصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيرٍ، وَاجْعَلِ المَوتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ». أخرجه مسلم."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَسْأَلُكَ الهُدَى وَالتُّقَى وَالعَفَافَ وَالغِنَى». أخرجه مسلم."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ، وَالجُبْنِ وَالبُخْلِ، وَالهَرمِ وَعَذَابِ القَبْرِ، اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَولاهَا، اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لا يَنْفَعُ، وَمِنْ قَلْبٍ لا يَخْشَعُ، وَمِنْ نَفْسٍ لا تَشْبَعُ، وَمِنْ دَعْوَةٍ لا يُسْتَجَابُ لَهَا». أخرجه مسلم."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ اهْدِنِي وَسَدِّدْنِي» «اللَّهُمَّ إنِّي أَسْأَلُكَ الهُدَى وَالسَّدَادَ». أخرجه مسلم."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَاعَمِلْتُ، وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ». أخرجه مسلم."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَالحَزَنِ، وَالعَجْزِ وَالكَسَلِ، وَالجُبْنِ وَالبُخْلِ، وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ». أخرجه البخاري."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«لا إلَهَ إلَّا الله العَظِيمُ الحَلِيمُ، لا إلَهَ إلَّا الله رَبُّ العَرْشِ العَظِيمِ، لا إلَهَ إلَّا الله رَبُّ السَّمَاوَاتِ، وَرَبُّ الأَرْضِ، وَرَبُّ العَرْشِ الكَرِيمِ». متفق عليه."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ مُصَرِّفَ القُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ». أخرجه مسلم."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ الجُبنِ، وَأَعُوذُ بِكَ مِنَ البُخْلِ، وَأَعُوذُ بِكَ مِنْ أَنْ أُرَدَّ إلَى أَرْذَلِ العُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا وَعَذَابِ القَبْرِ». أخرجه البخاري."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ الكَسَلِ وَالهَرَمِ، وَالمَغْرَمِ، وَالمَأْثَمِ، اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنْ عَذَابِ النَّارِ، وَفِتْنَةِ النَّارِ، وَفِتْنَةِ القَبْرِ، وَعَذَابِ القَبْرِ، وَشَرِّ فِتْنَةِ الغِنَى، وَشَرِّ فِتْنَةِ الفَقْرِ، وَمِنْ شَرِّ فِتْنَةِ المَسِيحِ الدَّجَّالِ اللَّهُمَّ اغْسِلْ خَطَايَايَ بِمَاءِ الثَّلْجِ وَالبَرَدِ، وَنَقِّ قَلْبِي مِنَ الخَطَايَا كَمَا يُنَقَّى الثَّوبُ الأَبْيَضُ مِنَ الدَّنَسِ، وَبَاعِدْ بَيْنِي وَبَينَ خَطَايَايَ كَمَا بَاعَدْتَ بَينَ المَشْرِقِ وَالمَغْرِبِ». متفق عليه."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً، وَلا يَغْفِرُ الذُّنُوبَ إلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي إنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ». متفق عليه."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ لَكَ أَسْلَمْتُ، وَبِكَ آمَنْتُ، وَعَلَيكَ تَوَكَّلْتُ، وَإلَيكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ، اللَّهُمَّ إنِّي أَعُوذُ بِعِزَّتِكَ لا إلَهَ إلَّا أَنْتَ أَنْ تُضِلَّنِي، أَنْتَ الحَيُّ الَّذِي لا يَمُوتُ، وَالجِنُّ وَالإنْسُ يَمُوتُونَ». متفق عليه."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ اغْفِرْ لِي خَطِيْئَتِي وَجَهْلِي، وَإسْرَافِي فِي أَمْرِي، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، اللَّهُمَّ اغْفِرْ لِي جِدِّيْ وَهَزْلِيْ، وَخَطَئِي وَعَمْدِي وَكُلُّ ذَلِكَ عِنْدِي اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ، وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ». متفق عليه."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ». أخرجه مسلم. «اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي، وَاهْدِنِي، وَعَافِنِي، وَارْزُقْنِي». أخرجه مسلم."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي عَبْدُكَ وابْنُ عَبْدِكَ وَابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ، أَوْ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلاءَ حُزنِي، وَذَهَابَ هَمِّي».أخرجه أحمد."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«يَا مُقَلِّبَ القُلُوبِ ثَبِّتْ قَلْبِي عَلَى دِينِكَ». أخرجه أحمد والترمذي."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«إسْأَلُوا الله العَفْوَ وَالعَافِيَةَ، فَإنَّ أَحَداً لَمْ يُعْطَ بَعْدَ اليَقِينِ خَيراً مِنَ العَافِيةِ». أخرجه الترمذي."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنْ شَرِّ سَمْعِي، وَمِنْ شَرِّ بَصَرِي، وَمِنْ شَرِّ لِسَانِي، وَمِنْ شَرِّ قَلْبِي وَمِنْ شَرِّ مَنِيِّي». أخرجه الترمذي والنسائي."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ البَرَصِ وَالجُنُونِ وَالجُذَامِ وَمِنْ سَيِّئِ الأَسْقَامِ».أخرجه أبو داود والنسائي."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنْ مُنْكَرَاتِ الأَخْلاقِ وَالأَعْمَالِ وَالأَهْوَاءِ».أخرجه الترمذي."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«رَبِّ أَعِنِّي وَلا تُعِنْ عَلَيَّ، وَانْصُرنِي وَلا تَنْصُرْ عَلَيَّ، وَامْكُرْ لِي وَلا تَمْكُر عَلَيَّ، وَاهْدِنِي وَيَسِّرِ الهُدَى لِي، وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ، رَبِّ اجْعَلْنِي لَكَ شَكَّاراً، لَكَ ذَكَّاراً، لَكَ رَهَّاباً، لَكَ مِطْوَاعاً، لَكَ مُخْبِتاً، إليكَ أَوَّاهاً مُنِيباً رَبِّ تَقَبَّلْ تَوْبَتِي، وَاغْسِلْ حَوْبَتِي، وَأَجِبْ دَعْوَتِي، وَثَبِّتْ حُجَّتِي، وَسَدِّدْ لِسَانِي، وَاهْدِ قَلْبِي، وَاسْلُلْ سَخِيمَةَ صَدْرِي». أخرجه أبو داود والترمذي."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَسْأَلُكَ مِنَ الخَيرِ كُلِّهِ، عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ، عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، اللَّهُمَّ إنِّي أَسْأَلُكَ مِنْ خَيرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ بِهِ عَبْدُكَ وَنَبِيُّكَ، اللَّهُمَّ إنِّي أَسْأَلُكَ الجَنَّةَ ومَا قَرَّبَ إلَيْهَا مِنْ قَولٍ أَوْ عَمَلٍ، وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إلَيْهَا مِنْ قَولٍ أَوْ عَمَلٍ، وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْراً». أخرجه أحمد وابن ماجه."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا يَحُولُ بَيْنَنَا وَبَينَ مَعَاصِيكَ، وَمِنْ طَاعَتِكَ مَا تُبَلِّغُنَا بِهِ جَنَّتَكَ، وَمِنَ اليَقِينِ مَا تَهُوِّنُ بِهِ عَلَينَا مُصِيبَاتِ الدُّنْيَا، وَمَتِّعْنَا بِأَسْمَاعِنَا، وَأَبْصَارِنَا، وَقُوَّتِنَا، مَا أَحْيَيْتَنَا، وَاجْعَلْهُ الوَارِثَ مِنَّا، وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا، وَانْصُرْنَا عَلَى مَنْ عَادَانَا، وَلا تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا، وَلا تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا، وَلا مَبْلَغَ عِلْمِنَا، وَلا تُسَلِّطْ عَلَيْنَا مَنْ لا يَرْحَمُنَا». أخرجه الترمذي."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ الهَدْمِ، وَأَعُوذُ بِكَ مِنَ التَّرَدِّي، وَأَعُوذُ بِكَ مِنَ الغَرَقِ وَالحَرَقِ والهَرَمِ، وَأَعُوذُ بِكَ أَنْ يَتَخَبَّطَنِيَ الشَّيْطَانُ عِنْدَ المَوتِ، وَأَعُوذُ بِكَ أَنْ أَمُوتَ فِي سَبِيلِكَ مُدْبِراً، وَأَعُوذُ بِكَ أَنْ أَمُوتَ لَدِيغاً». أخرجه أبو داود والنسائي."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ الجُوعِ فَإنَّهُ بِئْسَ الضَّجِيعُ، وَأَعُوذُ بِكَ مِنَ الخِيَانَةِ فَإنَّهَا بِئْسَتِ البِطَانَةُ». أخرجه أبو داود والنسائي."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَعُوذُ بِكَ من الفَقْرِ، وَالقِلَّةِ وَالذِّلَّةِ، وَأَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أَوْ أُظْلَمَ». أخرجه أبو داود والنسائي."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَسْأَلُكَ يَا الله بِأَنَّكَ الوَاحِدُ الأَحَدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ أَنْ تَغْفِرَ لِي ذُنُوبِي إنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ». أخرجه أبو داود والنسائي."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَسْأَلُكَ بِأَنَّ لَكَ الحَمْدُ، لا إلَهَ إلَّا أَنْتَ المنَّانُ بَدِيعُ السَّمَاوَاتِ وَالأَرْضِ، يَاذَا الجَلالِ وَالإكْرَامِ، يَا حَيُّ يَا قَيُّومُ إنِّي أَسْأَلُكَ». أخرجه أبو داود والنسائي."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ الله لا إلَهَ إلَّا أَنْتَ الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ، وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ». أخرجه الترمذي وابن ماجه."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«رَبِّ اغْفِرْ لي وَتُبْ عَلَيَّ إنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ».أخرجه الترمذي وابن ماجه."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ بِعِلْمِكَ الغَيْبَ، وَقُدْرَتِكَ عَلَى الخَلْقِ، أَحْيِنِي مَا عَلِمْتَ الحَيَاةَ خَيراً لِي، وَتَوفَّني إذَا عَلِمْتَ الوَفَاةَ خَيْراً لِي، اللَّهُمَّ وَأَسْأَلُكَ خَشْيَتَكَ فِي الغَيبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الحَقِّ فِي الرِّضَا وَالغَضَبِ، وَأَسْأَلُكَ القَصدَ فِي الفَقْرِ وَالغِنَى وَأَسْأَلُكَ نَعِيماً لا يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَينٍ لا تَنْقَطِعُ، وَأَسْأَلُكَ الرِّضَا بَعْدَ القَضَاءِ، وَأَسْأَلُكَ بَرْدَ العَيْشِ بَعْدَ الموْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إلَى وَجْهِكَ، وَالشَّوقَ إلَى لِقَائِكَ، فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الإيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ». أخرجه النسائي."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ مَتِّعْنِي بِسَمْعِي وَبَصَرِي، وَاجْعَلْهُمَا الوَارِثَ مِنِّي، وَانْصُرْنِي عَلَى مَنْ يَظْلِمُنِي، وَخُذْ مِنْهُ بِثَأرِي». أخرجه الترمذي."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ بَارِكْ لَنَا فِي مَدِينَتِنَا وَفِي ثِمَارِنَا وَفِي مُدِّنَا وَفِي صَاعِنَا، بَرَكَةً مَعَ بَرَكَةٍ». أخرجه مسلم."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّينِ، وَغَلَبَةِ العَدُوِّ، وَشَمَاتَةِ الأَعْدَاءِ». أخرجه أحمد والنسائي."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنِّي أَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِن تَحْتِي». أخرجه أبو داود والنسائي."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنَّكَ عَفُوٌّ كَرِىمٌ تُحِبُّ العَفْوَ فَاعْفُ عَنِّي».أخرجه الترمذي وابن ماجه."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ إنَّكَ عَفُوٌّ تُحِبُّ العَفْوَ فَاعْفُ عَنِّي». أخرجه أحمد وابن ماجه."));
        sonnaNabawyaArrayList.add(new SonnaNabawya("«اللَّهُمَّ أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عَقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ لا أُحْصِي ثَنَاءً عَلَيكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ». أخرجه مسلم."));


        mRecyclerViewSonnaNabawya = findViewById(R.id.recyclerView_sonna_nabawya);
        mRecyclerViewSonnaNabawya.setHasFixedSize(true);
        mLayoutManagerSonnaNabawya = new LinearLayoutManager(this);
        mAdapterSonnaNabawya = new SonnaNabawyaAdapter(sonnaNabawyaArrayList);
        mRecyclerViewSonnaNabawya.setLayoutManager(mLayoutManagerSonnaNabawya);
        mRecyclerViewSonnaNabawya.setAdapter(mAdapterSonnaNabawya);

    }
}